[
  {
    "content": "I don't know much about what goes on inside so this is a review and guide for visitors. What do i think about this place?  I've never visited anyone in jail before this one so I'm going to rate it average.  Most of the police are easy to talk to if you need anything.  There is plenty of parking as well (but don't park in the reserved spaces).Another visitor said their website does not have detailed instructions for visitation so here are some tips.First of all, make sure you are on the visitation list (ask the person you're visiting before you make the trip here). If not, you will not be allowed in. What was once a 30 minute wait is now a 2 hour wait. It seems that their process has become less organized concerning visitation in recent months so I'm not sure what is going on with their system. Procedure:Make sure you sign in asap on the sign in book. A family arrived an hour before mine but they didn't sign in so they waited with us while other people who arrived after them went in first.The police at the jail give you a few forms to fill out about visitors. If there aren't alot of people you can wait inside in the air conditioned waiting area.  However if it is busy you may be waiting outside in the hot Georgia weather. Dress code for visitors: Please please please wear pants and clothing that do NOT have metal on it! No khaki, no shorts, no exercise or yoga type of pants, no backless shoes, no bra with underwire (the metal sets off the alarm), etc. Once you find an outfit they allow in, wear it everytime you visit! They will send you back if you don't pass the dress code!  There is a Rite Aid and a dollar store nearby (neither are within waking distance).I wear pants that have plastic buttons, sneakers, and a tshirt. I don't wear jewelry either. What to bring:Leave the cell phone. Bring in as little as possible: ID, car keys, money for vending machine. That's it. Make sure to zip this money in a clear bag. Only $30 or less allowed and it must be in single $1 bills or coins. Btw, the food in the vending machine isn't all that great.  Best to eat before your visit. If you must eat vending food, the best is the hot wings.  There are some other savory foods you can microwave too. They vary the food from time to time so the selection is not always the same. (But the hot wings are always available.) Any food you buy must be eaten or thrown away when you leave. Visitation is from 8:30 until 3:30 Friday through Sunday (not sure if Thursday is also a visitation day - contact the jail for more info). It's usually packed on holidays and saturdays so try to come during other visitation days.", 
    "rating": "3.0", 
    "date": "2014-07-15"
  }
]