[
  {
    "content": "How do you rate a prison?   Not sure but I am sure that the rating depends on which side of the bars your on.  This facility has three components.   A women's prison, mens prison, and a minimal security women's camp.  To see the  women's prison, visitors enter through the front door, check in, and go through the metal detector.  A visitation room is just on the right and you can visit a good part of the day.  For the visitors though, this is as far as you go.  For the prisoners, they pass the control room and enter what looks like a junior college campus.  Many buildings spread out with open space.   Just to the right is the chapel that serves all denominations.  Just beyond that is a gym where the women take a variety of classes such as spinning or Zumba.  It also has pottery workshop, a library, and a knitting/sewing room.  There is also weight lifting available.  An outdoor rec area includes tennis courts and a track.  Beyond that are the main dorms.  These are small rooms with 3 bunks.  No bars on these rooms just a solid wooden door.  No doors on the sink and toilet.  Each of the dorms has television, an open area, and email access.  There are also communal washing machines. There are opportunities for work.   Kitchen, grounds, maintenance or a Unicor telephone facility.  In this case, the women answer phones to handle magazine subscriptions.  Pay is minimal and they can spend it at the commissary.  For those with disciplinary problems, you get put into the SHU.  This is a separate building where you are in isolation. You can get into a 10x30' fenced pen an hour a day five days a week.  Otherwise you stay in your cell.   Food is brought to you.  The cells do have showers which you can use 3 x a week.  There was a building for education classes.  The women are required to work towards a GED.  Some make it some don't.  The grounds are open and plenty of space to walk around.  The geese were all over the place and there were at least two resident cats.  Don't try getting out though.  A tall fence with electronic monitors and 11 strands of razor sharp barbed wire prevent that. I must admit that the facilities were better than expected.   But not a place anyone wants to spend time at.",
    "rating": "3.0",
    "date": "2013-12-05"
  },
  {
    "content": "(Written from experience taking tours through here in 2003 and 2005, as well as extensive research and contact with prisoners inside).Opened in 1974; The Federal Correctional Institution (FCI) in Dublin, is a medium-low security facility housing female prisoners.  Pop: FCI: 1,626.The institution has an adjacent administrative detention facility housing Men on \"holdover\" or pre-trial status, and a Min. security satellite camp housing adult Women prisoners. 20 miles S.E. of Oakland, FCI sit on the \"Camp Parks Army Reserve Forces Training Area\" Military Base.One result of the international \"war on drugs\" has been the internationalization of the U.S. prison population. From what I could see with my own eyes, many of the women locked up here were from Latin American, and for the most part, they are the low level \"mules\" who are either blackmailed, intimidated, or forced by economic hardship into carrying drugs into the U.S. They are being captured and incarcerated in ever-increasing numbers. At least 25% of inmates in the federal prison system today will be subject to deportation when their sentences are completed. While inside, our tour guide casually mentioned that the \"Foreign inmates\" were deported by plane and then bused across the border into Tijuana, often in the middle of the night. We heard later from Marilyn Buck (who we were able to catch a word with in the Chapel) that these women are often brutalized or taken advantage of by people waiting at these bus stops, since the woman are vulnerable and have just been released from years inside a US Federal prison. On top of this, since many of the women have lived in the US their whole lives, they may be from a southern state in Mexico, 18 hours away form the border. Many women have lived in the US their whole lives, but since they didn't have their immigration papers, they are sent to Tijuana where they have nothing of a support system. This further increases their chances to become re-involved in underground economies.FCI Houses/ed Political Prisoners:~ MARILYN BUCK - currently serving a total of 80 years for her anti-imperialist actions carried out in support of national liberation, women's liberation, social and economic justice. monthlyreview.org/0204bu…prisonactivist.org/pps+p…~LINDA EVANS (released): an Anti-Imperialist political prisoner active in the fight against imperialism since 1967. She was arrested in 1985, charged with acquisition of weapons, safe houses, finances, political and military training and actions to bring the war against U.S. imperialism home to America. She was serving 40 yrs when Clinton commuted it (Jan 2001). (prisonactivist.org/pps+p… )LaVonne Roach: a Native woman from South Dakota- currently serving a 30-year sentence. Active in the Four Winds Cultural Group. She says, \"We may not be physically free, but we have strong free spirits. As long as we never give up we will succeed.\"LINKS/INFO on FCI POLITICAL PRISONERS:prisonactivist.org/?q=ta…breakallchains.blogspot.…Mediation Groups Inside: bpf.org/html/turning_whe…",
    "rating": "1.0",
    "date": "2007-03-28"
  }
]