[
  {
    "content": "This place wouldn't exist if not for our tax dollars and the people who work here probably went to night school to obtain a GED at best. They are rude, uncourteous and on a mission to make the visitors as uncomfortable as possible so we never want to come back. And for people who have the common misconception that federal prison has racket ball courts and a swimming pool, you're sorely mistaken. The inmates are treated like pit bulls at the pound for minor crimes (well at least the inmate I'm visiting). Praying my loved one gets transferred because this is a piece of hell.", 
    "rating": "1.0", 
    "date": "2014-10-03"
  }, 
  {
    "content": "The food was great, the service was incredible and you really can't beat the price.  I was a catholic priest in a former life and performed some \"unsanctioned acts\" during my time of service.  I was put in prison given a cell mate that found me as attractive as can be. He called me his Mariah Carey.  When we made love, I hit new octaves.  Thank you metropolitan detention center for helping me find my boyfriend.  Not only do you serve food and an ass whooping, but you're a professional match making center!!!!  Can't ask for more than that.", 
    "rating": "5.0", 
    "date": "2014-08-21"
  }, 
  {
    "content": "This prison's food is very fairly priced because it's free but the quality is abysmal and the atmosphere is very aggressive. Furthermore the guards do very little to improve the energy of the room by failing use lively paint for the walls or provide ample lighting", 
    "rating": "3.0", 
    "date": "2013-10-15"
  }, 
  {
    "content": "My cellmate was incredibly rude.", 
    "rating": "1.0", 
    "date": "2013-05-04"
  }, 
  {
    "content": "I guess I'm giving it two stars, because I don't see asshole corrections officers driving like maniacs on the street, and it looks reasonably clean from the outside.  But since it's a federal prison, I wonder where they keep the raquetball courts and the olympic size swimming pool.", 
    "rating": "2.0", 
    "date": "2012-10-25"
  }, 
  {
    "content": "lol. i want to see someone give jail more than 1-star.", 
    "rating": "1.0", 
    "date": "2010-09-24"
  }, 
  {
    "content": "In 1972 a crack commando unit was sent to prison by a military court for a crime they didn't commit. These men promptly escaped from a maximum security stockade to the Los Angeles underground. Today, still wanted by the government, they survive as soldiers of fortune. If you have a problem, if no one else can help, and if you can find them, maybe you can hire the A-Team. Even B.A. Baracus became the 'little spoon' here.If you streak, you'll end up here and have someone calling you \"mija.\"  I don't recommend it, fellow Yelpers.", 
    "rating": "1.0", 
    "date": "2008-12-18"
  }, 
  {
    "content": "If you are arrested for a federal crime in the central district of california (los angeles, orange county, ventura county, san bernardino & riverside counties) chance are that you'll be brought to this facility, which is the on-site jail for the downtown los angeles federal court house.  The entrance is awkwardly located on alameda- no parking in the near vicinity plus it's right by the freeway.  But once you're inside it's pretty decent- they bring the inmates down to you (at some federal detention centers you have to go the floor the inmate is on).  I found the staff to be courteous and efficient while visiting a client, but that is generally the case with federal prison guards- they are civil servants and rank several rungs higher on the ladder then your average county sheriff's deputy or private corporate prison guard.One star because- hey- it's jail.", 
    "rating": "1.0", 
    "date": "2008-10-25"
  }
]