[
  {
    "content": "It's a moral shame and it's a blessing of transparency. It's a moral shame because this is how a civilized society treats its convicted criminals. This building has the dark architecture of Kafka. It allows prisoners to see slits of sunlight but not to enjoy a full bath of it. The form of the building confesses its brutality. The shape allows it to be sort of a reverse of Foucault and Bentham's Panopticon, by allowing the prisoners a better view of society than society of them. A small percentage of people inside are innocent. A large percentage are guilty, but are serving sentences for non-violent offenses. The Bible and instinct teach us that \"an eye for an eye\" equates to justice. If someone commits a non-violent offense but their body is wrapped in concrete for years, is their punishment tailored to their crime? Have they imprisoned or harmed a body such that we ought to imprison and harm their body? It's a blessing of transparency because it does not disguise from mass public view how we treat human beings in a country that purports to believe in individual liberty and that \"all men are created equal.\" Has anyone murdered more innocent people in this world than Barack Obama or George W. Bush? Do the crimes of anyone inside this dungeon compare to their crimes? Will those two men or anyone who has abetted their crimes ever fear even the possibility of an indictment? All men are created equal, but society tears apart our natural equality and replaces it with prestigious degrees, abundant money, and influential positions. Those three tools create unequal legal outcomes. Intelligence Director James Clapper can lie to Congress but if Jamal lies to a low-level Cook County court, he will be locked away and painted as a lesion on society's skin. You can steal $50 billion dollars from the lower and middle classes if you work for a bank, but if you steal $50 from a banker in the Loop, you'll spend 10 years at this wonderful institution. This building is a moral shame and a blessing of transparency.", 
    "rating": "1.0", 
    "date": "2013-11-19"
  }, 
  {
    "content": "Incredibly scary structure. The leading architect on the building was Harry Weese; his work is recognizable by triangular, brutalist styles.", 
    "rating": "5.0", 
    "date": "2013-02-04"
  }, 
  {
    "content": "Great food. Comfy beds. I'm innocent!", 
    "rating": "3.0", 
    "date": "2012-12-20"
  }, 
  {
    "content": "Wow, this prison is totally Azkaban. PLEASE tell me other people have thought/realized this too.", 
    "rating": "5.0", 
    "date": "2012-03-13"
  }, 
  {
    "content": "inmates live here.", 
    "rating": "5.0", 
    "date": "2011-07-27"
  }, 
  {
    "content": "When I found myself bored at my old job, I simply had to look out my window and watch the prisoners roaming around on the roof of the building during their free time. A bit creepy to watch them pressed up against the metal gate peering down on the Loop, and also straight into my office. The courtyard has nice benches for eating lunch on during the summer; but the many pigeons and the feeling of being watched by prisoners can have adverse effects on ones appetite.", 
    "rating": "3.0", 
    "date": "2007-03-03"
  }, 
  {
    "content": "Wow, how to rate this?  On one hand I want to give this only one star or less due to the fact that it is downtown and could be big trouble if someone went prison break there.  On the other hand, for years I went to school and worked not too far from here and walked within two blocks of this place all the time and did not know a correctional facility existed in the area and I want to give it five stars for that.  I guess i'll just have to give it a rating in the middle.", 
    "rating": "3.0", 
    "date": "2006-02-28"
  }, 
  {
    "content": "This funky jailhouse in the Loop was designed by Harry Weese and Associates. The tall triangular concrete structure has thin vertical windows that are five inches wide to allow for natural light for the prisoners, without allowing them to slip out.", 
    "rating": "4.0", 
    "date": "2005-09-08"
  }, 
  {
    "content": "Oh my gosh, this is HYSTERICAL.  The downtown prison is up for review?  Well where do I start... fascinating architecture.  It's shaped sort of like a triangle with very thin rectangular windows out of which the inmates can peer at the beautiful urban milieu below.  Wendy's, Taco Bell, Popeyes and other eateries are directly across the street - not that this matters if you live in the correctional center.  But if you happen to be visiting someone there, then hey, you won't have to go very far for lunch once your visiting time is up.  Service inside the correctional center is rather slow; I suggest hiring new guards.", 
    "rating": "1.0", 
    "date": "2005-07-27"
  }
]