[
  {
    "content": "Big money and big planning went into the siting of this federal holding pen in this part of Philadelphia. Shortly before 9-11. You can bet they looked at the location and the environment from every angle. This area north of Independence Mall is kinda cold; formal; stodgy; not a lot of life to it. No bars or clubs; and rather empty of people or residences. And then the nearby US Constitution Center came in as well; in addition to the long-standing US Mint and Federal Reserve Bank. So this is some serious clout and presence, folks. Feds basically own this zone in Philly and you better behave. They can cordon off all these blocks any time they want to--in the name of national security. Anyway. I'd definitely suggest that the chief of all their treasures is this state-of-the-art detention facility. Boy, you don't want to do anything wrong when walking down this street. You're on camera for sure; probably a computer scanner is probably checking out your particular gait (the way you walk) against a database of the hip-motion of all known international most-wanted criminals. Probably reading the labels on your jeans. So don't even dare spit, litter, or jaywalk.That being said; it actually is a strangely eerie, beautiful building. Severe and hard, certainly. Striving to be as invisible as possible. Gives off an 'icy', remorseless, vibe. It could survive a lot of different kinds of explosives--you betcha. Very blocky and stout; muscular-looking structure.One unusual thing is the window apertures. You know this is where the miserable prisoners must be held because these windows are barely worth being called windows; they're so thin you could hardly fit a playing card through. They look like archer's slits in a medieval castle. I used to gaze at this building a lot; I worked in the vicinity and ate my lunch across from here plenty of times.Oh well. Let us hope neither you nor I ever wind up inside. This is just bad. You do not want to run afoul of the people who operate this place. No way, no how. Talk about something hard to wipe off one's resume. Just figure your ass has 'gone to the blades' if your life ever leads you through the portals of this fearsome citadel.", 
    "rating": "3.0", 
    "date": "2012-09-20"
  }
]